layer {
  name: "front"
  time_unit: "usec"
  cpu: 3075.39990234
  cpu2: 3075.39990234
  cpu3: 3075.39990234
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 4841.0
  cpu2: 8848.0
  cpu3: 8848.0
  gpu: 1190.0
  npu: 322.723083496
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 5311.70019531
  cpu2: 9771.29980469
  cpu3: 9771.29980469
  gpu: 1478.0
  npu: 361.338470459
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 5753.0
  cpu2: 12312.0
  cpu3: 12312.0
  gpu: 675.0
  npu: 287.123077393
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 2862.69995117
  cpu2: 5727.0
  cpu3: 5727.0
  gpu: 957.0
  npu: 189.738464355
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 12318.7001953
  cpu2: 22893.0
  cpu3: 22893.0
  gpu: 2374.0
  npu: 843.49230957
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 10192.2998047
  cpu2: 22691.3007812
  cpu3: 22691.3007812
  gpu: 812.0
  npu: 258.923065186
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 3124.30004883
  cpu2: 7253.29980469
  cpu3: 7253.29980469
  gpu: 635.0
  npu: 146.615386963
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 5990.70019531
  cpu2: 12673.7001953
  cpu3: 12673.7001953
  gpu: 1060.0
  npu: 396.153839111
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 8621.29980469
  cpu2: 18472.0
  cpu3: 18472.0
  gpu: 700.0
  npu: 329.18460083
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 5315.0
  cpu2: 11697.0
  cpu3: 11697.0
  gpu: 857.0
  npu: 195.846160889
}
layer {
  name: "s1"
  time_unit: "usec"
  cpu: 151.0
  cpu2: 275.700012207
  cpu3: 275.700012207
  gpu: 69.0
  npu: 17.5846157074
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 5469.0
  cpu2: 10614.7001953
  cpu3: 10614.7001953
  gpu: 1012.0
  npu: 375.538452148
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 2250.30004883
  cpu2: 4842.0
  cpu3: 4842.0
  gpu: 445.0
  npu: 133.49230957
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 1133.30004883
  cpu2: 2251.69995117
  cpu3: 2251.69995117
  gpu: 369.0
  npu: 88.9230804443
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 2023.30004883
  cpu2: 3966.30004883
  cpu3: 3966.30004883
  gpu: 560.0
  npu: 167.430770874
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 2337.69995117
  cpu2: 4514.70019531
  cpu3: 4514.70019531
  gpu: 379.0
  npu: 159.538467407
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 1552.69995117
  cpu2: 3386.0
  cpu3: 3386.0
  gpu: 518.0
  npu: 107.276924133
}
layer {
  name: "s2"
  time_unit: "usec"
  cpu: 89.3000030518
  cpu2: 181.0
  cpu3: 181.0
  gpu: 22.0
  npu: 12.4615383148
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 2017.69995117
  cpu2: 3982.69995117
  cpu3: 3982.69995117
  gpu: 545.0
  npu: 169.738464355
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 2334.69995117
  cpu2: 4537.0
  cpu3: 4537.0
  gpu: 367.0
  npu: 158.769226074
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 1565.30004883
  cpu2: 3442.0
  cpu3: 3442.0
  gpu: 512.0
  npu: 103.800003052
}
layer {
  name: "s3"
  time_unit: "usec"
  cpu: 92.0
  cpu2: 173.699996948
  cpu3: 173.699996948
  gpu: 23.0
  npu: 11.64615345
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 2026.69995117
  cpu2: 3973.30004883
  cpu3: 3973.30004883
  gpu: 533.0
  npu: 172.046157837
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 2344.30004883
  cpu2: 4536.0
  cpu3: 4536.0
  gpu: 367.0
  npu: 158.199996948
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 2233.69995117
  cpu2: 4662.29980469
  cpu3: 4662.29980469
  gpu: 578.0
  npu: 133.430770874
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 5201.0
  cpu2: 10230.7001953
  cpu3: 10230.7001953
  gpu: 904.0
  npu: 329.430755615
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 5177.29980469
  cpu2: 9269.29980469
  cpu3: 9269.29980469
  gpu: 516.0
  npu: 292.769226074
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 4106.0
  cpu2: 8358.29980469
  cpu3: 8358.29980469
  gpu: 759.0
  npu: 213.123077393
}
layer {
  name: "s4"
  time_unit: "usec"
  cpu: 175.0
  cpu2: 302.299987793
  cpu3: 302.299987793
  gpu: 41.0
  npu: 14.8769226074
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 5262.0
  cpu2: 10146.0
  cpu3: 10146.0
  gpu: 896.0
  npu: 335.953857422
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 5045.70019531
  cpu2: 9435.29980469
  cpu3: 9435.29980469
  gpu: 523.0
  npu: 293.953857422
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 4029.30004883
  cpu2: 8423.0
  cpu3: 8423.0
  gpu: 747.0
  npu: 206.969238281
}
layer {
  name: "s5"
  time_unit: "usec"
  cpu: 165.300003052
  cpu2: 297.700012207
  cpu3: 297.700012207
  gpu: 42.0
  npu: 14.9692306519
}
layer {
  name: "c29"
  time_unit: "usec"
  cpu: 5219.0
  cpu2: 10248.7001953
  cpu3: 10248.7001953
  gpu: 907.0
  npu: 330.200012207
}
layer {
  name: "c30"
  time_unit: "usec"
  cpu: 5164.70019531
  cpu2: 9712.0
  cpu3: 9712.0
  gpu: 525.0
  npu: 291.846160889
}
layer {
  name: "c31"
  time_unit: "usec"
  cpu: 4045.30004883
  cpu2: 8456.70019531
  cpu3: 8456.70019531
  gpu: 751.0
  npu: 206.723083496
}
layer {
  name: "s6"
  time_unit: "usec"
  cpu: 167.300003052
  cpu2: 299.0
  cpu3: 299.0
  gpu: 40.0
  npu: 14.8153848648
}
layer {
  name: "c32"
  time_unit: "usec"
  cpu: 4974.0
  cpu2: 9650.70019531
  cpu3: 9650.70019531
  gpu: 908.0
  npu: 328.50769043
}
layer {
  name: "c33"
  time_unit: "usec"
  cpu: 1606.0
  cpu2: 3001.69995117
  cpu3: 3001.69995117
  gpu: 385.0
  npu: 119.846153259
}
layer {
  name: "c34"
  time_unit: "usec"
  cpu: 1065.30004883
  cpu2: 2046.0
  cpu3: 2046.0
  gpu: 449.0
  npu: 76.9692306519
}
layer {
  name: "c35"
  time_unit: "usec"
  cpu: 2003.30004883
  cpu2: 3894.0
  cpu3: 3894.0
  gpu: 604.0
  npu: 152.50769043
}
layer {
  name: "c36"
  time_unit: "usec"
  cpu: 1488.0
  cpu2: 2619.0
  cpu3: 2619.0
  gpu: 411.0
  npu: 134.50769043
}
layer {
  name: "c37"
  time_unit: "usec"
  cpu: 1548.69995117
  cpu2: 2994.0
  cpu3: 2994.0
  gpu: 631.0
  npu: 113.33846283
}
layer {
  name: "s7"
  time_unit: "usec"
  cpu: 126.699996948
  cpu2: 265.299987793
  cpu3: 265.299987793
  gpu: 14.0
  npu: 9.12307739258
}
layer {
  name: "c38"
  time_unit: "usec"
  cpu: 2030.30004883
  cpu2: 3900.0
  cpu3: 3900.0
  gpu: 613.0
  npu: 153.276916504
}
layer {
  name: "c39"
  time_unit: "usec"
  cpu: 1512.0
  cpu2: 2602.30004883
  cpu3: 2602.30004883
  gpu: 414.0
  npu: 136.0
}
layer {
  name: "c40"
  time_unit: "usec"
  cpu: 1564.0
  cpu2: 2970.30004883
  cpu3: 2970.30004883
  gpu: 637.0
  npu: 109.892311096
}
layer {
  name: "s8"
  time_unit: "usec"
  cpu: 127.699996948
  cpu2: 260.299987793
  cpu3: 260.299987793
  gpu: 14.0
  npu: 8.66153812408
}
layer {
  name: "c41"
  time_unit: "usec"
  cpu: 2178.0
  cpu2: 4103.29980469
  cpu3: 4103.29980469
  gpu: 613.0
  npu: 156.723083496
}
layer {
  name: "c42"
  time_unit: "usec"
  cpu: 502.299987793
  cpu2: 797.0
  cpu3: 797.0
  gpu: 355.0
  npu: 84.2615356445
}
layer {
  name: "c43"
  time_unit: "usec"
  cpu: 909.299987793
  cpu2: 1331.0
  cpu3: 1331.0
  gpu: 564.0
  npu: 133.953842163
}
layer {
  name: "c44"
  time_unit: "usec"
  cpu: 1710.0
  cpu2: 2541.30004883
  cpu3: 2541.30004883
  gpu: 494.0
  npu: 227.384613037
}
layer {
  name: "c45"
  time_unit: "usec"
  cpu: 921.0
  cpu2: 1383.0
  cpu3: 1383.0
  gpu: 332.0
  npu: 119.123077393
}
layer {
  name: "c46"
  time_unit: "usec"
  cpu: 1451.30004883
  cpu2: 2138.30004883
  cpu3: 2138.30004883
  gpu: 805.0
  npu: 210.923080444
}
layer {
  name: "s9"
  time_unit: "usec"
  cpu: 120.0
  cpu2: 138.699996948
  cpu3: 138.699996948
  gpu: 13.0
  npu: 9.53846168518
}
layer {
  name: "c47"
  time_unit: "usec"
  cpu: 1704.0
  cpu2: 2561.69995117
  cpu3: 2561.69995117
  gpu: 495.0
  npu: 224.876922607
}
layer {
  name: "c48"
  time_unit: "usec"
  cpu: 914.299987793
  cpu2: 1372.69995117
  cpu3: 1372.69995117
  gpu: 334.0
  npu: 121.49230957
}
layer {
  name: "c49"
  time_unit: "usec"
  cpu: 1456.0
  cpu2: 2124.69995117
  cpu3: 2124.69995117
  gpu: 812.0
  npu: 211.384613037
}
layer {
  name: "s10"
  time_unit: "usec"
  cpu: 118.0
  cpu2: 138.699996948
  cpu3: 138.699996948
  gpu: 14.0
  npu: 9.18461513519
}
layer {
  name: "c50"
  time_unit: "usec"
  cpu: 1712.0
  cpu2: 2560.0
  cpu3: 2560.0
  gpu: 496.0
  npu: 227.184616089
}
layer {
  name: "c51"
  time_unit: "usec"
  cpu: 917.700012207
  cpu2: 1370.69995117
  cpu3: 1370.69995117
  gpu: 339.0
  npu: 119.646156311
}
layer {
  name: "c52"
  time_unit: "usec"
  cpu: 2584.69995117
  cpu2: 3796.30004883
  cpu3: 3796.30004883
  gpu: 883.0
  npu: 376.723083496
}
layer {
  name: "c53"
  time_unit: "usec"
  cpu: 3635.69995117
  cpu2: 5438.70019531
  cpu3: 5438.70019531
  gpu: 860.0
  npu: 471.18460083
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 203.0
  cpu2: 204.0
  cpu3: 204.0
  gpu: 26.0
  npu: 23.3384609222
}
layer {
  name: "c54"
  time_unit: "usec"
  cpu: 1257.0
  cpu2: 1808.0
  cpu3: 1808.0
  gpu: 692.0
  npu: 77.6923065186
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 19.0
  cpu2: 19.0
  cpu3: 19.0
  gpu: 999999.0
  npu: 999999.0
}
