layer {
  name: "front"
  time_unit: "usec"
  cpu: 3075.39990234
  cpu2: 3075.39990234
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 4551.70019531
  cpu2: 8848.0
  gpu: 1190.0
  npu: 699.233337402
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 5056.0
  cpu2: 9771.29980469
  gpu: 1478.0
  npu: 782.900024414
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 5463.0
  cpu2: 12312.0
  gpu: 675.0
  npu: 622.099975586
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 2861.69995117
  cpu2: 5727.0
  gpu: 957.0
  npu: 411.100006104
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 11721.0
  cpu2: 22893.0
  gpu: 2374.0
  npu: 1827.56665039
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 10061.2998047
  cpu2: 22691.3007812
  gpu: 812.0
  npu: 561.0
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 3239.0
  cpu2: 7253.29980469
  gpu: 635.0
  npu: 317.666656494
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 5780.0
  cpu2: 12673.7001953
  gpu: 1060.0
  npu: 858.333312988
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 7795.70019531
  cpu2: 18472.0
  gpu: 700.0
  npu: 713.233337402
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 5108.70019531
  cpu2: 11697.0
  gpu: 857.0
  npu: 424.333343506
}
layer {
  name: "s1"
  time_unit: "usec"
  cpu: 164.300003052
  cpu2: 275.700012207
  gpu: 69.0
  npu: 38.0999984741
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 5442.0
  cpu2: 10614.7001953
  gpu: 1012.0
  npu: 813.666687012
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 2207.69995117
  cpu2: 4842.0
  gpu: 445.0
  npu: 289.233337402
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 1120.0
  cpu2: 2251.69995117
  gpu: 369.0
  npu: 192.666671753
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 2019.30004883
  cpu2: 3966.30004883
  gpu: 560.0
  npu: 362.766662598
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 2290.0
  cpu2: 4514.70019531
  gpu: 379.0
  npu: 345.666656494
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 1582.30004883
  cpu2: 3386.0
  gpu: 518.0
  npu: 232.433334351
}
layer {
  name: "s2"
  time_unit: "usec"
  cpu: 112.0
  cpu2: 181.0
  gpu: 22.0
  npu: 27.0
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 2018.0
  cpu2: 3982.69995117
  gpu: 545.0
  npu: 367.766662598
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 2290.30004883
  cpu2: 4537.0
  gpu: 367.0
  npu: 344.0
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 1583.0
  cpu2: 3442.0
  gpu: 512.0
  npu: 224.899993896
}
layer {
  name: "s3"
  time_unit: "usec"
  cpu: 109.300003052
  cpu2: 173.699996948
  gpu: 23.0
  npu: 25.2333335876
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 2032.30004883
  cpu2: 3973.30004883
  gpu: 533.0
  npu: 372.766662598
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 2335.0
  cpu2: 4536.0
  gpu: 367.0
  npu: 342.766662598
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 2236.0
  cpu2: 4662.29980469
  gpu: 578.0
  npu: 289.100006104
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 4962.70019531
  cpu2: 10230.7001953
  gpu: 904.0
  npu: 713.766662598
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 5250.0
  cpu2: 9269.29980469
  gpu: 516.0
  npu: 634.333312988
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 4159.0
  cpu2: 8358.29980469
  gpu: 759.0
  npu: 461.766662598
}
layer {
  name: "s4"
  time_unit: "usec"
  cpu: 203.699996948
  cpu2: 302.299987793
  gpu: 41.0
  npu: 32.2333335876
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 5041.70019531
  cpu2: 10146.0
  gpu: 896.0
  npu: 727.900024414
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 4916.70019531
  cpu2: 9435.29980469
  gpu: 523.0
  npu: 636.900024414
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 3957.69995117
  cpu2: 8423.0
  gpu: 747.0
  npu: 448.433319092
}
layer {
  name: "s5"
  time_unit: "usec"
  cpu: 187.0
  cpu2: 297.700012207
  gpu: 42.0
  npu: 32.4333343506
}
layer {
  name: "c29"
  time_unit: "usec"
  cpu: 4895.29980469
  cpu2: 10248.7001953
  gpu: 907.0
  npu: 715.433349609
}
layer {
  name: "c30"
  time_unit: "usec"
  cpu: 4912.70019531
  cpu2: 9712.0
  gpu: 525.0
  npu: 632.333312988
}
layer {
  name: "c31"
  time_unit: "usec"
  cpu: 3941.30004883
  cpu2: 8456.70019531
  gpu: 751.0
  npu: 447.899993896
}
layer {
  name: "s6"
  time_unit: "usec"
  cpu: 184.300003052
  cpu2: 299.0
  gpu: 40.0
  npu: 32.0999984741
}
layer {
  name: "c32"
  time_unit: "usec"
  cpu: 4767.0
  cpu2: 9650.70019531
  gpu: 908.0
  npu: 711.766662598
}
layer {
  name: "c33"
  time_unit: "usec"
  cpu: 1686.30004883
  cpu2: 3001.69995117
  gpu: 385.0
  npu: 259.666656494
}
layer {
  name: "c34"
  time_unit: "usec"
  cpu: 1025.30004883
  cpu2: 2046.0
  gpu: 449.0
  npu: 166.766662598
}
layer {
  name: "c35"
  time_unit: "usec"
  cpu: 1959.69995117
  cpu2: 3894.0
  gpu: 604.0
  npu: 330.433319092
}
layer {
  name: "c36"
  time_unit: "usec"
  cpu: 1502.0
  cpu2: 2619.0
  gpu: 411.0
  npu: 291.433319092
}
layer {
  name: "c37"
  time_unit: "usec"
  cpu: 1445.69995117
  cpu2: 2994.0
  gpu: 631.0
  npu: 245.566665649
}
layer {
  name: "s7"
  time_unit: "usec"
  cpu: 113.0
  cpu2: 265.299987793
  gpu: 14.0
  npu: 19.7666664124
}
layer {
  name: "c38"
  time_unit: "usec"
  cpu: 1964.30004883
  cpu2: 3900.0
  gpu: 613.0
  npu: 332.100006104
}
layer {
  name: "c39"
  time_unit: "usec"
  cpu: 1526.0
  cpu2: 2602.30004883
  gpu: 414.0
  npu: 294.666656494
}
layer {
  name: "c40"
  time_unit: "usec"
  cpu: 1463.30004883
  cpu2: 2970.30004883
  gpu: 637.0
  npu: 238.100006104
}
layer {
  name: "s8"
  time_unit: "usec"
  cpu: 118.699996948
  cpu2: 260.299987793
  gpu: 14.0
  npu: 18.7666664124
}
layer {
  name: "c41"
  time_unit: "usec"
  cpu: 2041.69995117
  cpu2: 4103.29980469
  gpu: 613.0
  npu: 339.566680908
}
layer {
  name: "c42"
  time_unit: "usec"
  cpu: 476.700012207
  cpu2: 797.0
  gpu: 355.0
  npu: 182.566665649
}
layer {
  name: "c43"
  time_unit: "usec"
  cpu: 726.0
  cpu2: 1331.0
  gpu: 564.0
  npu: 290.233337402
}
layer {
  name: "c44"
  time_unit: "usec"
  cpu: 1407.69995117
  cpu2: 2541.30004883
  gpu: 494.0
  npu: 492.666656494
}
layer {
  name: "c45"
  time_unit: "usec"
  cpu: 867.299987793
  cpu2: 1383.0
  gpu: 332.0
  npu: 258.100006104
}
layer {
  name: "c46"
  time_unit: "usec"
  cpu: 1103.69995117
  cpu2: 2138.30004883
  gpu: 805.0
  npu: 457.0
}
layer {
  name: "s9"
  time_unit: "usec"
  cpu: 110.0
  cpu2: 138.699996948
  gpu: 13.0
  npu: 20.6666660309
}
layer {
  name: "c47"
  time_unit: "usec"
  cpu: 1407.0
  cpu2: 2561.69995117
  gpu: 495.0
  npu: 487.233337402
}
layer {
  name: "c48"
  time_unit: "usec"
  cpu: 861.299987793
  cpu2: 1372.69995117
  gpu: 334.0
  npu: 263.233337402
}
layer {
  name: "c49"
  time_unit: "usec"
  cpu: 1110.30004883
  cpu2: 2124.69995117
  gpu: 812.0
  npu: 458.0
}
layer {
  name: "s10"
  time_unit: "usec"
  cpu: 112.0
  cpu2: 138.699996948
  gpu: 14.0
  npu: 19.8999996185
}
layer {
  name: "c50"
  time_unit: "usec"
  cpu: 1412.30004883
  cpu2: 2560.0
  gpu: 496.0
  npu: 492.233337402
}
layer {
  name: "c51"
  time_unit: "usec"
  cpu: 864.700012207
  cpu2: 1370.69995117
  gpu: 339.0
  npu: 259.233337402
}
layer {
  name: "c52"
  time_unit: "usec"
  cpu: 1959.0
  cpu2: 3796.30004883
  gpu: 883.0
  npu: 816.233337402
}
layer {
  name: "c53"
  time_unit: "usec"
  cpu: 2905.0
  cpu2: 5438.70019531
  gpu: 860.0
  npu: 1020.90002441
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 203.0
  cpu2: 204.0
  gpu: 26.0
  npu: 50.5666656494
}
layer {
  name: "c54"
  time_unit: "usec"
  cpu: 1372.69995117
  cpu2: 1808.0
  gpu: 692.0
  npu: 168.333328247
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 19.0
  cpu2: 19.0
  gpu: 999999.0
  npu: 999999.0
}
