layer {
  name: "front"
  time_unit: "usec"
  cpu: 3153.5
  cpu2: 3153.5
  cpu3: 3153.5
  cpu4: 3153.5
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 52693.0
  cpu2: 52693.0
  cpu3: 52693.0
  cpu4: 52693.0
  gpu: 4479.0
  npu: 1151.73840332
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 2159.0
  cpu2: 2159.0
  cpu3: 2159.0
  cpu4: 2159.0
  gpu: 293.0
  npu: 67.3384628296
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 12095.0
  cpu2: 12095.0
  cpu3: 12095.0
  cpu4: 12095.0
  gpu: 1497.0
  npu: 413.338470459
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 21541.0
  cpu2: 21541.0
  cpu3: 21541.0
  cpu4: 21541.0
  gpu: 2345.0
  npu: 558.50769043
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 17061.0
  cpu2: 17061.0
  cpu3: 17061.0
  cpu4: 17061.0
  gpu: 1710.0
  npu: 470.200012207
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 21617.0
  cpu2: 21617.0
  cpu3: 21617.0
  cpu4: 21617.0
  gpu: 2125.0
  npu: 553.846130371
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 23926.0
  cpu2: 23926.0
  cpu3: 23926.0
  cpu4: 23926.0
  gpu: 1856.0
  npu: 566.876953125
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 20977.0
  cpu2: 20977.0
  cpu3: 20977.0
  cpu4: 20977.0
  gpu: 2026.0
  npu: 556.046142578
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 25570.0
  cpu2: 25570.0
  cpu3: 25570.0
  cpu4: 25570.0
  gpu: 1995.0
  npu: 634.353820801
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 19974.0
  cpu2: 19974.0
  cpu3: 19974.0
  cpu4: 19974.0
  gpu: 1927.0
  npu: 559.799987793
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 28115.0
  cpu2: 28115.0
  cpu3: 28115.0
  cpu4: 28115.0
  gpu: 2160.0
  npu: 699.338439941
}
layer {
  name: "p2"
  time_unit: "usec"
  cpu: 749.0
  cpu2: 749.0
  cpu3: 749.0
  cpu4: 749.0
  gpu: 95.0
  npu: 38.7692298889
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 4624.0
  cpu2: 4624.0
  cpu3: 4624.0
  cpu4: 4624.0
  gpu: 669.0
  npu: 177.892303467
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 4867.0
  cpu2: 4867.0
  cpu3: 4867.0
  cpu4: 4867.0
  gpu: 849.0
  npu: 394.415374756
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 5285.0
  cpu2: 5285.0
  cpu3: 5285.0
  cpu4: 5285.0
  gpu: 769.0
  npu: 199.646148682
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 4787.0
  cpu2: 4787.0
  cpu3: 4787.0
  cpu4: 4787.0
  gpu: 839.0
  npu: 396.0
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 6111.0
  cpu2: 6111.0
  cpu3: 6111.0
  cpu4: 6111.0
  gpu: 913.0
  npu: 216.769226074
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 4811.0
  cpu2: 4811.0
  cpu3: 4811.0
  cpu4: 4811.0
  gpu: 855.0
  npu: 393.384613037
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 7046.0
  cpu2: 7046.0
  cpu3: 7046.0
  cpu4: 7046.0
  gpu: 882.0
  npu: 231.846160889
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 4959.0
  cpu2: 4959.0
  cpu3: 4959.0
  cpu4: 4959.0
  gpu: 841.0
  npu: 392.661529541
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 8530.0
  cpu2: 8530.0
  cpu3: 8530.0
  cpu4: 8530.0
  gpu: 1070.0
  npu: 252.307693481
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 5167.0
  cpu2: 5167.0
  cpu3: 5167.0
  cpu4: 5167.0
  gpu: 859.0
  npu: 394.415374756
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 9727.0
  cpu2: 9727.0
  cpu3: 9727.0
  cpu4: 9727.0
  gpu: 1170.0
  npu: 267.230773926
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 5295.0
  cpu2: 5295.0
  cpu3: 5295.0
  cpu4: 5295.0
  gpu: 875.0
  npu: 402.50769043
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 10868.0
  cpu2: 10868.0
  cpu3: 10868.0
  cpu4: 10868.0
  gpu: 1213.0
  npu: 287.646148682
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 5278.0
  cpu2: 5278.0
  cpu3: 5278.0
  cpu4: 5278.0
  gpu: 871.0
  npu: 402.307678223
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 11228.0
  cpu2: 11228.0
  cpu3: 11228.0
  cpu4: 11228.0
  gpu: 1306.0
  npu: 304.876922607
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 5286.0
  cpu2: 5286.0
  cpu3: 5286.0
  cpu4: 5286.0
  gpu: 881.0
  npu: 399.076934814
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 20247.0
  cpu2: 20247.0
  cpu3: 20247.0
  cpu4: 20247.0
  gpu: 2067.0
  npu: 507.692321777
}
layer {
  name: "p3"
  time_unit: "usec"
  cpu: 394.0
  cpu2: 394.0
  cpu3: 394.0
  cpu4: 394.0
  gpu: 58.0
  npu: 28.6615390778
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 1853.0
  cpu2: 1853.0
  cpu3: 1853.0
  cpu4: 1853.0
  gpu: 636.0
  npu: 82.7692337036
}
layer {
  name: "c29"
  time_unit: "usec"
  cpu: 1756.0
  cpu2: 1756.0
  cpu3: 1756.0
  cpu4: 1756.0
  gpu: 655.0
  npu: 85.3384628296
}
layer {
  name: "c30"
  time_unit: "usec"
  cpu: 2035.0
  cpu2: 2035.0
  cpu3: 2035.0
  cpu4: 2035.0
  gpu: 671.0
  npu: 88.4153823853
}
layer {
  name: "c31"
  time_unit: "usec"
  cpu: 1608.0
  cpu2: 1608.0
  cpu3: 1608.0
  cpu4: 1608.0
  gpu: 635.0
  npu: 85.8461532593
}
layer {
  name: "c32"
  time_unit: "usec"
  cpu: 2191.0
  cpu2: 2191.0
  cpu3: 2191.0
  cpu4: 2191.0
  gpu: 706.0
  npu: 93.8000030518
}
layer {
  name: "c33"
  time_unit: "usec"
  cpu: 1626.0
  cpu2: 1626.0
  cpu3: 1626.0
  cpu4: 1626.0
  gpu: 657.0
  npu: 85.8461532593
}
layer {
  name: "c34"
  time_unit: "usec"
  cpu: 2272.0
  cpu2: 2272.0
  cpu3: 2272.0
  cpu4: 2272.0
  gpu: 739.0
  npu: 98.7230758667
}
layer {
  name: "c35"
  time_unit: "usec"
  cpu: 1614.0
  cpu2: 1614.0
  cpu3: 1614.0
  cpu4: 1614.0
  gpu: 652.0
  npu: 85.646156311
}
layer {
  name: "c36"
  time_unit: "usec"
  cpu: 2454.0
  cpu2: 2454.0
  cpu3: 2454.0
  cpu4: 2454.0
  gpu: 768.0
  npu: 105.030769348
}
layer {
  name: "c37"
  time_unit: "usec"
  cpu: 1637.0
  cpu2: 1637.0
  cpu3: 1637.0
  cpu4: 1637.0
  gpu: 679.0
  npu: 84.9692306519
}
layer {
  name: "c38"
  time_unit: "usec"
  cpu: 2617.0
  cpu2: 2617.0
  cpu3: 2617.0
  cpu4: 2617.0
  gpu: 802.0
  npu: 111.538459778
}
layer {
  name: "c39"
  time_unit: "usec"
  cpu: 1645.0
  cpu2: 1645.0
  cpu3: 1645.0
  cpu4: 1645.0
  gpu: 677.0
  npu: 85.2307662964
}
layer {
  name: "c40"
  time_unit: "usec"
  cpu: 17416.0
  cpu2: 17416.0
  cpu3: 17416.0
  cpu4: 17416.0
  gpu: 2367.0
  npu: 598.046142578
}
layer {
  name: "p4"
  time_unit: "usec"
  cpu: 1162.0
  cpu2: 1162.0
  cpu3: 1162.0
  cpu4: 1162.0
  gpu: 71.0
  npu: 116.723075867
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 19.0
  cpu2: 19.0
  cpu3: 19.0
  cpu4: 19.0
  gpu: 999999.0
  npu: 999999.0
}
