layer {
  name: "front"
  time_unit: "usec"
  cpu: 1949.69995117
  cpu2: 1949.69995117
  cpu3: 1949.69995117
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 8177.89990234
  cpu2: 14569.0996094
  cpu3: 14569.0996094
  gpu: 1701.0
  npu: 395.130004883
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 1239.69995117
  cpu2: 2073.10009766
  cpu3: 2073.10009766
  gpu: 466.0
  npu: 76.3000030518
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 1416.09997559
  cpu2: 2393.60009766
  cpu3: 2393.60009766
  gpu: 686.0
  npu: 77.0
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 2304.0
  cpu2: 3911.30004883
  cpu3: 3911.30004883
  gpu: 697.0
  npu: 120.830001831
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 3817.30004883
  cpu2: 6626.79980469
  cpu3: 6626.79980469
  gpu: 1032.0
  npu: 194.669998169
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 2108.30004883
  cpu2: 3545.19995117
  cpu3: 3545.19995117
  gpu: 824.0
  npu: 117.400001526
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 2289.80004883
  cpu2: 3915.19995117
  cpu3: 3915.19995117
  gpu: 706.0
  npu: 120.269996643
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 3801.39990234
  cpu2: 6588.79980469
  cpu3: 6588.79980469
  gpu: 1031.0
  npu: 195.199996948
}
layer {
  name: "p2"
  time_unit: "usec"
  cpu: 765.700012207
  cpu2: 1101.69995117
  cpu3: 1101.69995117
  gpu: 317.0
  npu: 53.7299995422
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 826.400024414
  cpu2: 1231.90002441
  cpu3: 1231.90002441
  gpu: 591.0
  npu: 49.0
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 1361.90002441
  cpu2: 2252.80004883
  cpu3: 2252.80004883
  gpu: 580.0
  npu: 73.4000015259
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 4729.70019531
  cpu2: 6033.89990234
  cpu3: 6033.89990234
  gpu: 876.0
  npu: 268.369995117
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 1337.80004883
  cpu2: 2199.5
  cpu3: 2199.5
  gpu: 694.0
  npu: 78.0699996948
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 1365.40002441
  cpu2: 2238.39990234
  cpu3: 2238.39990234
  gpu: 589.0
  npu: 73.5299987793
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 4829.89990234
  cpu2: 6030.10009766
  cpu3: 6030.10009766
  gpu: 887.0
  npu: 267.829986572
}
layer {
  name: "p3"
  time_unit: "usec"
  cpu: 451.200012207
  cpu2: 554.400024414
  cpu3: 554.400024414
  gpu: 294.0
  npu: 42.2000007629
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 477.100006104
  cpu2: 589.0
  cpu3: 589.0
  gpu: 635.0
  npu: 32.4300003052
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 552.299987793
  cpu2: 750.900024414
  cpu3: 750.900024414
  gpu: 501.0
  npu: 36.2999992371
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 1403.19995117
  cpu2: 2356.60009766
  cpu3: 2356.60009766
  gpu: 773.0
  npu: 93.0299987793
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 586.700012207
  cpu2: 779.799987793
  cpu3: 779.799987793
  gpu: 765.0
  npu: 38.7999992371
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 552.799987793
  cpu2: 753.299987793
  cpu3: 753.299987793
  gpu: 508.0
  npu: 37.4700012207
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 1380.40002441
  cpu2: 2343.60009766
  cpu3: 2343.60009766
  gpu: 775.0
  npu: 93.6299972534
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 706.299987793
  cpu2: 972.400024414
  cpu3: 972.400024414
  gpu: 784.0
  npu: 47.2999992371
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 723.5
  cpu2: 1037.80004883
  cpu3: 1037.80004883
  gpu: 554.0
  npu: 47.9300003052
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 1898.30004883
  cpu2: 3192.10009766
  cpu3: 3192.10009766
  gpu: 906.0
  npu: 129.169998169
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 912.799987793
  cpu2: 1268.40002441
  cpu3: 1268.40002441
  gpu: 897.0
  npu: 61.2999992371
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 717.900024414
  cpu2: 1030.09997559
  cpu3: 1030.09997559
  gpu: 556.0
  npu: 48.2000007629
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 1910.40002441
  cpu2: 3192.10009766
  cpu3: 3192.10009766
  gpu: 913.0
  npu: 128.830001831
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 7216.10009766
  cpu2: 10986.4003906
  cpu3: 10986.4003906
  gpu: 2113.0
  npu: 500.600006104
}
layer {
  name: "p4"
  time_unit: "usec"
  cpu: 619.0
  cpu2: 625.5
  cpu3: 625.5
  gpu: 57.0
  npu: 61.5699996948
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 11.3000001907
  cpu2: 11.3000001907
  cpu3: 11.3000001907
  gpu: 999999.0
  npu: 999999.0
}
