layer {
  name: "front"
  time_unit: "usec"
  cpu: 1949.69995117
  cpu2: 1949.69995117
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 6958.0
  cpu2: 14569.0996094
  gpu: 1701.0
  npu: 263.420013428
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 1054.69995117
  cpu2: 2073.10009766
  gpu: 466.0
  npu: 50.8666648865
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 1182.69995117
  cpu2: 2393.60009766
  gpu: 686.0
  npu: 51.3333320618
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 1997.30004883
  cpu2: 3911.30004883
  gpu: 697.0
  npu: 80.5533370972
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 3257.30004883
  cpu2: 6626.79980469
  gpu: 1032.0
  npu: 129.779998779
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 1755.30004883
  cpu2: 3545.19995117
  gpu: 824.0
  npu: 78.2666702271
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 1977.0
  cpu2: 3915.19995117
  gpu: 706.0
  npu: 80.1800003052
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 3249.0
  cpu2: 6588.79980469
  gpu: 1031.0
  npu: 130.133331299
}
layer {
  name: "p2"
  time_unit: "usec"
  cpu: 656.0
  cpu2: 1101.69995117
  gpu: 317.0
  npu: 35.8199996948
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 715.299987793
  cpu2: 1231.90002441
  gpu: 591.0
  npu: 32.6666679382
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 1205.0
  cpu2: 2252.80004883
  gpu: 580.0
  npu: 48.9333343506
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 3269.0
  cpu2: 6033.89990234
  gpu: 876.0
  npu: 178.913330078
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 1119.0
  cpu2: 2199.5
  gpu: 694.0
  npu: 52.0466651917
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 1203.30004883
  cpu2: 2238.39990234
  gpu: 589.0
  npu: 49.0200004578
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 3267.69995117
  cpu2: 6030.10009766
  gpu: 887.0
  npu: 178.553329468
}
layer {
  name: "p3"
  time_unit: "usec"
  cpu: 453.0
  cpu2: 554.400024414
  gpu: 294.0
  npu: 28.1333332062
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 399.700012207
  cpu2: 589.0
  gpu: 635.0
  npu: 21.6200008392
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 466.700012207
  cpu2: 750.900024414
  gpu: 501.0
  npu: 24.2000007629
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 1132.30004883
  cpu2: 2356.60009766
  gpu: 773.0
  npu: 62.0200004578
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 488.299987793
  cpu2: 779.799987793
  gpu: 765.0
  npu: 25.8666667938
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 467.299987793
  cpu2: 753.299987793
  gpu: 508.0
  npu: 24.9799995422
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 1134.69995117
  cpu2: 2343.60009766
  gpu: 775.0
  npu: 62.4199981689
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 582.299987793
  cpu2: 972.400024414
  gpu: 784.0
  npu: 31.5333328247
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 610.700012207
  cpu2: 1037.80004883
  gpu: 554.0
  npu: 31.953332901
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 1546.0
  cpu2: 3192.10009766
  gpu: 906.0
  npu: 86.1133346558
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 718.0
  cpu2: 1268.40002441
  gpu: 897.0
  npu: 40.8666648865
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 602.0
  cpu2: 1030.09997559
  gpu: 556.0
  npu: 32.1333351135
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 1553.30004883
  cpu2: 3192.10009766
  gpu: 913.0
  npu: 85.8866653442
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 5631.29980469
  cpu2: 10986.4003906
  gpu: 2113.0
  npu: 333.733337402
}
layer {
  name: "p4"
  time_unit: "usec"
  cpu: 535.0
  cpu2: 625.5
  gpu: 57.0
  npu: 41.0466651917
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 11.3000001907
  cpu2: 11.3000001907
  gpu: 999999.0
  npu: 999999.0
}
