layer {
  name: "front"
  time_unit: "usec"
  cpu: 1949.0
  cpu2: 1949.0
  cpu3: 1949.0
  cpu4: 1949.0
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 13358.2998047
  cpu2: 13358.2998047
  cpu3: 13358.2998047
  cpu4: 13358.2998047
  gpu: 1701.0
  npu: 395.130004883
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 1867.59997559
  cpu2: 1867.59997559
  cpu3: 1867.59997559
  cpu4: 1867.59997559
  gpu: 466.0
  npu: 76.3000030518
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 2011.5
  cpu2: 2011.5
  cpu3: 2011.5
  cpu4: 2011.5
  gpu: 686.0
  npu: 77.0
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 3349.19995117
  cpu2: 3349.19995117
  cpu3: 3349.19995117
  cpu4: 3349.19995117
  gpu: 697.0
  npu: 120.830001831
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 5998.89990234
  cpu2: 5998.89990234
  cpu3: 5998.89990234
  cpu4: 5998.89990234
  gpu: 1032.0
  npu: 194.669998169
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 3260.89990234
  cpu2: 3260.89990234
  cpu3: 3260.89990234
  cpu4: 3260.89990234
  gpu: 824.0
  npu: 117.400001526
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 3383.39990234
  cpu2: 3383.39990234
  cpu3: 3383.39990234
  cpu4: 3383.39990234
  gpu: 706.0
  npu: 120.269996643
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 5896.29980469
  cpu2: 5896.29980469
  cpu3: 5896.29980469
  cpu4: 5896.29980469
  gpu: 1031.0
  npu: 195.199996948
}
layer {
  name: "p2"
  time_unit: "usec"
  cpu: 941.599975586
  cpu2: 941.599975586
  cpu3: 941.599975586
  cpu4: 941.599975586
  gpu: 317.0
  npu: 53.7299995422
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 890.400024414
  cpu2: 890.400024414
  cpu3: 890.400024414
  cpu4: 890.400024414
  gpu: 591.0
  npu: 49.0
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 1755.09997559
  cpu2: 1755.09997559
  cpu3: 1755.09997559
  cpu4: 1755.09997559
  gpu: 580.0
  npu: 73.4000015259
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 3577.10009766
  cpu2: 3577.10009766
  cpu3: 3577.10009766
  cpu4: 3577.10009766
  gpu: 876.0
  npu: 268.369995117
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 1645.40002441
  cpu2: 1645.40002441
  cpu3: 1645.40002441
  cpu4: 1645.40002441
  gpu: 694.0
  npu: 78.0699996948
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 1732.30004883
  cpu2: 1732.30004883
  cpu3: 1732.30004883
  cpu4: 1732.30004883
  gpu: 589.0
  npu: 73.5299987793
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 3594.19995117
  cpu2: 3594.19995117
  cpu3: 3594.19995117
  cpu4: 3594.19995117
  gpu: 887.0
  npu: 267.829986572
}
layer {
  name: "p3"
  time_unit: "usec"
  cpu: 494.299987793
  cpu2: 494.299987793
  cpu3: 494.299987793
  cpu4: 494.299987793
  gpu: 294.0
  npu: 42.2000007629
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 417.399993896
  cpu2: 417.399993896
  cpu3: 417.399993896
  cpu4: 417.399993896
  gpu: 635.0
  npu: 32.4300003052
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 569.799987793
  cpu2: 569.799987793
  cpu3: 569.799987793
  cpu4: 569.799987793
  gpu: 501.0
  npu: 36.2999992371
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 1485.80004883
  cpu2: 1485.80004883
  cpu3: 1485.80004883
  cpu4: 1485.80004883
  gpu: 773.0
  npu: 93.0299987793
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 586.900024414
  cpu2: 586.900024414
  cpu3: 586.900024414
  cpu4: 586.900024414
  gpu: 765.0
  npu: 38.7999992371
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 571.299987793
  cpu2: 571.299987793
  cpu3: 571.299987793
  cpu4: 571.299987793
  gpu: 508.0
  npu: 37.4700012207
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 1460.19995117
  cpu2: 1460.19995117
  cpu3: 1460.19995117
  cpu4: 1460.19995117
  gpu: 775.0
  npu: 93.6299972534
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 763.599975586
  cpu2: 763.599975586
  cpu3: 763.599975586
  cpu4: 763.599975586
  gpu: 784.0
  npu: 47.2999992371
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 839.099975586
  cpu2: 839.099975586
  cpu3: 839.099975586
  cpu4: 839.099975586
  gpu: 554.0
  npu: 47.9300003052
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 2283.60009766
  cpu2: 2283.60009766
  cpu3: 2283.60009766
  cpu4: 2283.60009766
  gpu: 906.0
  npu: 129.169998169
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 1024.30004883
  cpu2: 1024.30004883
  cpu3: 1024.30004883
  cpu4: 1024.30004883
  gpu: 897.0
  npu: 61.2999992371
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 834.799987793
  cpu2: 834.799987793
  cpu3: 834.799987793
  cpu4: 834.799987793
  gpu: 556.0
  npu: 48.2000007629
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 2253.69995117
  cpu2: 2253.69995117
  cpu3: 2253.69995117
  cpu4: 2253.69995117
  gpu: 913.0
  npu: 128.830001831
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 10410.7998047
  cpu2: 10410.7998047
  cpu3: 10410.7998047
  cpu4: 10410.7998047
  gpu: 2113.0
  npu: 500.600006104
}
layer {
  name: "p4"
  time_unit: "usec"
  cpu: 602.599975586
  cpu2: 602.599975586
  cpu3: 602.599975586
  cpu4: 602.599975586
  gpu: 57.0
  npu: 61.5699996948
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 11.3000001907
  cpu2: 11.3000001907
  cpu3: 11.3000001907
  cpu4: 11.3000001907
  gpu: 999999.0
  npu: 999999.0
}
