layer {
  name: "front"
  time_unit: "usec"
  cpu: 1949.69995117
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 3951.30004883
  gpu: 1701.0
  npu: 607.892333984
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 763.0
  gpu: 466.0
  npu: 117.384613037
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 770.0
  gpu: 686.0
  npu: 118.461540222
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 1208.30004883
  gpu: 697.0
  npu: 185.892303467
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 1946.69995117
  gpu: 1032.0
  npu: 299.49230957
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 1174.0
  gpu: 824.0
  npu: 180.615386963
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 1202.69995117
  gpu: 706.0
  npu: 185.030761719
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 1952.0
  gpu: 1031.0
  npu: 300.307678223
}
layer {
  name: "p2"
  time_unit: "usec"
  cpu: 537.299987793
  gpu: 317.0
  npu: 82.6615371704
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 490.0
  gpu: 591.0
  npu: 75.3846130371
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 734.0
  gpu: 580.0
  npu: 112.923080444
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 2683.69995117
  gpu: 876.0
  npu: 412.876922607
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 780.700012207
  gpu: 694.0
  npu: 120.107688904
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 735.299987793
  gpu: 589.0
  npu: 113.123077393
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 2678.30004883
  gpu: 887.0
  npu: 412.046142578
}
layer {
  name: "p3"
  time_unit: "usec"
  cpu: 422.0
  gpu: 294.0
  npu: 64.9230804443
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 324.299987793
  gpu: 635.0
  npu: 49.8923072815
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 363.0
  gpu: 501.0
  npu: 55.8461532593
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 930.299987793
  gpu: 773.0
  npu: 143.123077393
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 388.0
  gpu: 765.0
  npu: 59.6923065186
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 374.700012207
  gpu: 508.0
  npu: 57.6461524963
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 936.299987793
  gpu: 775.0
  npu: 144.046157837
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 473.0
  gpu: 784.0
  npu: 72.7692337036
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 479.299987793
  gpu: 554.0
  npu: 73.7384643555
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 1291.69995117
  gpu: 906.0
  npu: 198.723083496
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 613.0
  gpu: 897.0
  npu: 94.3076934814
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 482.0
  gpu: 556.0
  npu: 74.1538467407
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 1288.30004883
  gpu: 913.0
  npu: 198.199996948
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 5006.0
  gpu: 2113.0
  npu: 770.153869629
}
layer {
  name: "p4"
  time_unit: "usec"
  cpu: 615.700012207
  gpu: 57.0
  npu: 94.7230758667
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 11.3000001907
  gpu: 999999.0
  npu: 999999.0
}
