layer {
  name: "front"
  time_unit: "usec"
  cpu: 2111.19995117
  cpu2: 2111.19995117
  cpu3: 2111.19995117
  cpu4: 2111.19995117
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 24279.6992188
  cpu2: 24279.6992188
  cpu3: 24279.6992188
  cpu4: 24279.6992188
  gpu: 3819.0
  npu: 1151.73840332
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 1417.69995117
  cpu2: 1417.69995117
  cpu3: 1417.69995117
  cpu4: 1417.69995117
  gpu: 173.0
  npu: 67.3384628296
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 8815.79980469
  cpu2: 8815.79980469
  cpu3: 8815.79980469
  cpu4: 8815.79980469
  gpu: 1308.0
  npu: 413.338470459
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 12401.4003906
  cpu2: 12401.4003906
  cpu3: 12401.4003906
  cpu4: 12401.4003906
  gpu: 1706.0
  npu: 558.50769043
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 10341.5
  cpu2: 10341.5
  cpu3: 10341.5
  cpu4: 10341.5
  gpu: 1469.0
  npu: 470.200012207
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 12460.2998047
  cpu2: 12460.2998047
  cpu3: 12460.2998047
  cpu4: 12460.2998047
  gpu: 1687.0
  npu: 553.846130371
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 12586.5
  cpu2: 12586.5
  cpu3: 12586.5
  cpu4: 12586.5
  gpu: 1663.0
  npu: 566.876953125
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 12332.7001953
  cpu2: 12332.7001953
  cpu3: 12332.7001953
  cpu4: 12332.7001953
  gpu: 1661.0
  npu: 556.046142578
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 14284.5996094
  cpu2: 14284.5996094
  cpu3: 14284.5996094
  cpu4: 14284.5996094
  gpu: 1879.0
  npu: 634.353820801
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 12391.5
  cpu2: 12391.5
  cpu3: 12391.5
  cpu4: 12391.5
  gpu: 1680.0
  npu: 559.799987793
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 15601.2998047
  cpu2: 15601.2998047
  cpu3: 15601.2998047
  cpu4: 15601.2998047
  gpu: 2069.0
  npu: 699.338439941
}
layer {
  name: "p2"
  time_unit: "usec"
  cpu: 696.900024414
  cpu2: 696.900024414
  cpu3: 696.900024414
  cpu4: 696.900024414
  gpu: 88.0
  npu: 38.7692298889
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 3120.0
  cpu2: 3120.0
  cpu3: 3120.0
  cpu4: 3120.0
  gpu: 779.0
  npu: 177.892303467
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 4044.0
  cpu2: 4044.0
  cpu3: 4044.0
  cpu4: 4044.0
  gpu: 880.0
  npu: 394.415374756
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 3442.5
  cpu2: 3442.5
  cpu3: 3442.5
  cpu4: 3442.5
  gpu: 862.0
  npu: 199.646148682
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 3972.5
  cpu2: 3972.5
  cpu3: 3972.5
  cpu4: 3972.5
  gpu: 905.0
  npu: 396.0
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 3986.60009766
  cpu2: 3986.60009766
  cpu3: 3986.60009766
  cpu4: 3986.60009766
  gpu: 924.0
  npu: 216.769226074
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 4115.60009766
  cpu2: 4115.60009766
  cpu3: 4115.60009766
  cpu4: 4115.60009766
  gpu: 881.0
  npu: 393.384613037
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 4454.89990234
  cpu2: 4454.89990234
  cpu3: 4454.89990234
  cpu4: 4454.89990234
  gpu: 982.0
  npu: 231.846160889
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 4227.70019531
  cpu2: 4227.70019531
  cpu3: 4227.70019531
  cpu4: 4227.70019531
  gpu: 894.0
  npu: 392.661529541
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 4593.70019531
  cpu2: 4593.70019531
  cpu3: 4593.70019531
  cpu4: 4593.70019531
  gpu: 1204.0
  npu: 252.307693481
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 4302.10009766
  cpu2: 4302.10009766
  cpu3: 4302.10009766
  cpu4: 4302.10009766
  gpu: 876.0
  npu: 394.415374756
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 5179.89990234
  cpu2: 5179.89990234
  cpu3: 5179.89990234
  cpu4: 5179.89990234
  gpu: 1259.0
  npu: 267.230773926
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 4457.70019531
  cpu2: 4457.70019531
  cpu3: 4457.70019531
  cpu4: 4457.70019531
  gpu: 875.0
  npu: 402.50769043
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 5458.89990234
  cpu2: 5458.89990234
  cpu3: 5458.89990234
  cpu4: 5458.89990234
  gpu: 1366.0
  npu: 287.646148682
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 4575.5
  cpu2: 4575.5
  cpu3: 4575.5
  cpu4: 4575.5
  gpu: 887.0
  npu: 402.307678223
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 5934.29980469
  cpu2: 5934.29980469
  cpu3: 5934.29980469
  cpu4: 5934.29980469
  gpu: 1384.0
  npu: 304.876922607
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 4902.20019531
  cpu2: 4902.20019531
  cpu3: 4902.20019531
  cpu4: 4902.20019531
  gpu: 859.0
  npu: 399.076934814
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 10502.7001953
  cpu2: 10502.7001953
  cpu3: 10502.7001953
  cpu4: 10502.7001953
  gpu: 2110.0
  npu: 507.692321777
}
layer {
  name: "p3"
  time_unit: "usec"
  cpu: 363.200012207
  cpu2: 363.200012207
  cpu3: 363.200012207
  cpu4: 363.200012207
  gpu: 49.0
  npu: 28.6615390778
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 1050.30004883
  cpu2: 1050.30004883
  cpu3: 1050.30004883
  cpu4: 1050.30004883
  gpu: 744.0
  npu: 82.7692337036
}
layer {
  name: "c29"
  time_unit: "usec"
  cpu: 976.0
  cpu2: 976.0
  cpu3: 976.0
  cpu4: 976.0
  gpu: 775.0
  npu: 85.3384628296
}
layer {
  name: "c30"
  time_unit: "usec"
  cpu: 1141.40002441
  cpu2: 1141.40002441
  cpu3: 1141.40002441
  cpu4: 1141.40002441
  gpu: 779.0
  npu: 88.4153823853
}
layer {
  name: "c31"
  time_unit: "usec"
  cpu: 928.299987793
  cpu2: 928.299987793
  cpu3: 928.299987793
  cpu4: 928.299987793
  gpu: 796.0
  npu: 85.8461532593
}
layer {
  name: "c32"
  time_unit: "usec"
  cpu: 1214.30004883
  cpu2: 1214.30004883
  cpu3: 1214.30004883
  cpu4: 1214.30004883
  gpu: 820.0
  npu: 93.8000030518
}
layer {
  name: "c33"
  time_unit: "usec"
  cpu: 936.700012207
  cpu2: 936.700012207
  cpu3: 936.700012207
  cpu4: 936.700012207
  gpu: 811.0
  npu: 85.8461532593
}
layer {
  name: "c34"
  time_unit: "usec"
  cpu: 1315.30004883
  cpu2: 1315.30004883
  cpu3: 1315.30004883
  cpu4: 1315.30004883
  gpu: 869.0
  npu: 98.7230758667
}
layer {
  name: "c35"
  time_unit: "usec"
  cpu: 929.700012207
  cpu2: 929.700012207
  cpu3: 929.700012207
  cpu4: 929.700012207
  gpu: 841.0
  npu: 85.646156311
}
layer {
  name: "c36"
  time_unit: "usec"
  cpu: 1426.09997559
  cpu2: 1426.09997559
  cpu3: 1426.09997559
  cpu4: 1426.09997559
  gpu: 931.0
  npu: 105.030769348
}
layer {
  name: "c37"
  time_unit: "usec"
  cpu: 924.099975586
  cpu2: 924.099975586
  cpu3: 924.099975586
  cpu4: 924.099975586
  gpu: 861.0
  npu: 84.9692306519
}
layer {
  name: "c38"
  time_unit: "usec"
  cpu: 1497.59997559
  cpu2: 1497.59997559
  cpu3: 1497.59997559
  cpu4: 1497.59997559
  gpu: 985.0
  npu: 111.538459778
}
layer {
  name: "c39"
  time_unit: "usec"
  cpu: 921.299987793
  cpu2: 921.299987793
  cpu3: 921.299987793
  cpu4: 921.299987793
  gpu: 918.0
  npu: 85.2307662964
}
layer {
  name: "c40"
  time_unit: "usec"
  cpu: 9533.79980469
  cpu2: 9533.79980469
  cpu3: 9533.79980469
  cpu4: 9533.79980469
  gpu: 2363.0
  npu: 598.046142578
}
layer {
  name: "p4"
  time_unit: "usec"
  cpu: 736.200012207
  cpu2: 736.200012207
  cpu3: 736.200012207
  cpu4: 736.200012207
  gpu: 66.0
  npu: 116.723075867
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 11.6999998093
  cpu2: 11.6999998093
  cpu3: 11.6999998093
  cpu4: 11.6999998093
  gpu: 999999.0
  npu: 999999.0
}
