layer {
  name: "front"
  time_unit: "usec"
  cpu: 2111.19995117
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 7486.29980469
  gpu: 3819.0
  npu: 499.086669922
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 437.700012207
  gpu: 173.0
  npu: 29.1800003052
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 2686.69995117
  gpu: 1308.0
  npu: 179.113327026
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 3630.30004883
  gpu: 1706.0
  npu: 242.020004272
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 3056.30004883
  gpu: 1469.0
  npu: 203.753326416
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 3600.0
  gpu: 1687.0
  npu: 240.0
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 3684.69995117
  gpu: 1663.0
  npu: 245.64666748
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 3614.30004883
  gpu: 1661.0
  npu: 240.953338623
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 4123.29980469
  gpu: 1879.0
  npu: 274.886657715
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 3638.69995117
  gpu: 1680.0
  npu: 242.580001831
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 4545.70019531
  gpu: 2069.0
  npu: 303.046661377
}
layer {
  name: "p2"
  time_unit: "usec"
  cpu: 252.0
  gpu: 88.0
  npu: 16.7999992371
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 1156.30004883
  gpu: 779.0
  npu: 77.0866699219
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 2563.69995117
  gpu: 880.0
  npu: 170.913330078
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 1297.69995117
  gpu: 862.0
  npu: 86.5133361816
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 2574.0
  gpu: 905.0
  npu: 171.600006104
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 1409.0
  gpu: 924.0
  npu: 93.9333343506
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 2557.0
  gpu: 881.0
  npu: 170.466659546
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 1507.0
  gpu: 982.0
  npu: 100.466667175
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 2552.30004883
  gpu: 894.0
  npu: 170.153335571
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 1640.0
  gpu: 1204.0
  npu: 109.333335876
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 2563.69995117
  gpu: 876.0
  npu: 170.913330078
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 1737.0
  gpu: 1259.0
  npu: 115.800003052
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 2616.30004883
  gpu: 875.0
  npu: 174.419998169
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 1869.69995117
  gpu: 1366.0
  npu: 124.64666748
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 2615.0
  gpu: 887.0
  npu: 174.333328247
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 1981.69995117
  gpu: 1384.0
  npu: 132.113327026
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 2594.0
  gpu: 859.0
  npu: 172.933334351
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 3300.0
  gpu: 2110.0
  npu: 220.0
}
layer {
  name: "p3"
  time_unit: "usec"
  cpu: 186.300003052
  gpu: 49.0
  npu: 12.4200000763
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 538.0
  gpu: 744.0
  npu: 35.8666648865
}
layer {
  name: "c29"
  time_unit: "usec"
  cpu: 554.700012207
  gpu: 775.0
  npu: 36.9799995422
}
layer {
  name: "c30"
  time_unit: "usec"
  cpu: 574.700012207
  gpu: 779.0
  npu: 38.313331604
}
layer {
  name: "c31"
  time_unit: "usec"
  cpu: 558.0
  gpu: 796.0
  npu: 37.2000007629
}
layer {
  name: "c32"
  time_unit: "usec"
  cpu: 609.700012207
  gpu: 820.0
  npu: 40.6466674805
}
layer {
  name: "c33"
  time_unit: "usec"
  cpu: 558.0
  gpu: 811.0
  npu: 37.2000007629
}
layer {
  name: "c34"
  time_unit: "usec"
  cpu: 641.700012207
  gpu: 869.0
  npu: 42.7799987793
}
layer {
  name: "c35"
  time_unit: "usec"
  cpu: 556.700012207
  gpu: 841.0
  npu: 37.1133346558
}
layer {
  name: "c36"
  time_unit: "usec"
  cpu: 682.700012207
  gpu: 931.0
  npu: 45.5133323669
}
layer {
  name: "c37"
  time_unit: "usec"
  cpu: 552.299987793
  gpu: 861.0
  npu: 36.8199996948
}
layer {
  name: "c38"
  time_unit: "usec"
  cpu: 725.0
  gpu: 985.0
  npu: 48.3333320618
}
layer {
  name: "c39"
  time_unit: "usec"
  cpu: 554.0
  gpu: 918.0
  npu: 36.9333343506
}
layer {
  name: "c40"
  time_unit: "usec"
  cpu: 3887.30004883
  gpu: 2363.0
  npu: 259.153320312
}
layer {
  name: "p4"
  time_unit: "usec"
  cpu: 758.700012207
  gpu: 66.0
  npu: 50.5800018311
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 11.6999998093
  gpu: 999999.0
  npu: 999999.0
}
