layer {
  name: "front"
  time_unit: "usec"
  cpu: 3071.89990234
  cpu2: 3071.89990234
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 4763.70019531
  cpu2: 4763.70019531
  gpu: 1243.0
  npu: 322.923065186
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 5938.70019531
  cpu2: 5938.70019531
  gpu: 698.0
  npu: 289.18460083
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 9732.29980469
  cpu2: 9732.29980469
  gpu: 2149.0
  npu: 644.461547852
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 6640.70019531
  cpu2: 6640.70019531
  gpu: 681.0
  npu: 178.107696533
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 6680.29980469
  cpu2: 6680.29980469
  gpu: 1337.0
  npu: 407.276916504
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 7751.0
  cpu2: 7751.0
  gpu: 685.0
  npu: 287.892303467
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 11472.0
  cpu2: 11472.0
  gpu: 1799.0
  npu: 513.692321777
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 1940.69995117
  cpu2: 1940.69995117
  gpu: 429.0
  npu: 118.461540222
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 4584.70019531
  cpu2: 4584.70019531
  gpu: 1092.0
  npu: 290.769226074
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 3154.30004883
  cpu2: 3154.30004883
  gpu: 442.0
  npu: 201.538467407
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 7349.70019531
  cpu2: 7349.70019531
  gpu: 1551.0
  npu: 385.18460083
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 1047.69995117
  cpu2: 1047.69995117
  gpu: 337.0
  npu: 84.2615356445
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 3166.0
  cpu2: 3166.0
  gpu: 988.0
  npu: 224.923080444
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 1518.69995117
  cpu2: 1518.69995117
  gpu: 405.0
  npu: 123.49230957
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 5384.70019531
  cpu2: 5384.70019531
  gpu: 1410.0
  npu: 385.276916504
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 1475.69995117
  cpu2: 1475.69995117
  gpu: 408.0
  npu: 125.184616089
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 5575.0
  cpu2: 5575.0
  gpu: 1415.0
  npu: 387.338470459
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 1565.69995117
  cpu2: 1565.69995117
  gpu: 396.0
  npu: 125.076919556
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 5708.70019531
  cpu2: 5708.70019531
  gpu: 1418.0
  npu: 385.799987793
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 1577.30004883
  cpu2: 1577.30004883
  gpu: 411.0
  npu: 124.769233704
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 5705.70019531
  cpu2: 5705.70019531
  gpu: 1403.0
  npu: 384.261535645
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 1560.30004883
  cpu2: 1560.30004883
  gpu: 397.0
  npu: 125.692306519
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 5870.70019531
  cpu2: 5870.70019531
  gpu: 1427.0
  npu: 387.076934814
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 452.299987793
  cpu2: 452.299987793
  gpu: 340.0
  npu: 83.0769195557
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 4360.0
  cpu2: 4360.0
  gpu: 910.0
  npu: 746.153869629
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 913.0
  cpu2: 913.0
  gpu: 348.0
  npu: 134.107696533
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 7922.0
  cpu2: 7922.0
  gpu: 1416.0
  npu: 1239.64611816
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 165.0
  cpu2: 165.0
  gpu: 24.0
  npu: 19.0769233704
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 885.0
  cpu2: 885.0
  gpu: 689.0
  npu: 68.0461502075
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 19.0
  cpu2: 19.0
  gpu: 999999.0
  npu: 999999.0
}
