layer {
  name: "front"
  time_unit: "usec"
  cpu: 3071.89990234
  cpu2: 3071.89990234
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 4763.70019531
  cpu2: 4763.70019531
  gpu: 1243.0
  npu: 139.933334351
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 5938.70019531
  cpu2: 5938.70019531
  gpu: 698.0
  npu: 125.313331604
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 9732.29980469
  cpu2: 9732.29980469
  gpu: 2149.0
  npu: 279.266662598
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 6640.70019531
  cpu2: 6640.70019531
  gpu: 681.0
  npu: 77.1800003052
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 6680.29980469
  cpu2: 6680.29980469
  gpu: 1337.0
  npu: 176.486663818
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 7751.0
  cpu2: 7751.0
  gpu: 685.0
  npu: 124.753334045
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 11472.0
  cpu2: 11472.0
  gpu: 1799.0
  npu: 222.600006104
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 1940.69995117
  cpu2: 1940.69995117
  gpu: 429.0
  npu: 51.3333320618
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 4584.70019531
  cpu2: 4584.70019531
  gpu: 1092.0
  npu: 126.0
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 3154.30004883
  cpu2: 3154.30004883
  gpu: 442.0
  npu: 87.3333358765
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 7349.70019531
  cpu2: 7349.70019531
  gpu: 1551.0
  npu: 166.913330078
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 1047.69995117
  cpu2: 1047.69995117
  gpu: 337.0
  npu: 36.5133323669
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 3166.0
  cpu2: 3166.0
  gpu: 988.0
  npu: 97.4666671753
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 1518.69995117
  cpu2: 1518.69995117
  gpu: 405.0
  npu: 53.5133323669
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 5384.70019531
  cpu2: 5384.70019531
  gpu: 1410.0
  npu: 166.953338623
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 1475.69995117
  cpu2: 1475.69995117
  gpu: 408.0
  npu: 54.2466659546
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 5575.0
  cpu2: 5575.0
  gpu: 1415.0
  npu: 167.846664429
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 1565.69995117
  cpu2: 1565.69995117
  gpu: 396.0
  npu: 54.2000007629
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 5708.70019531
  cpu2: 5708.70019531
  gpu: 1418.0
  npu: 167.179992676
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 1577.30004883
  cpu2: 1577.30004883
  gpu: 411.0
  npu: 54.0666656494
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 5705.70019531
  cpu2: 5705.70019531
  gpu: 1403.0
  npu: 166.513336182
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 1560.30004883
  cpu2: 1560.30004883
  gpu: 397.0
  npu: 54.4666671753
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 5870.70019531
  cpu2: 5870.70019531
  gpu: 1427.0
  npu: 167.733337402
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 452.299987793
  cpu2: 452.299987793
  gpu: 340.0
  npu: 36.0
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 4360.0
  cpu2: 4360.0
  gpu: 910.0
  npu: 323.333343506
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 913.0
  cpu2: 913.0
  gpu: 348.0
  npu: 58.1133346558
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 7922.0
  cpu2: 7922.0
  gpu: 1416.0
  npu: 537.179992676
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 165.0
  cpu2: 165.0
  gpu: 24.0
  npu: 8.26666641235
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 885.0
  cpu2: 885.0
  gpu: 689.0
  npu: 29.4866657257
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 19.0
  cpu2: 19.0
  gpu: 999999.0
  npu: 999999.0
}
