layer {
  name: "front"
  time_unit: "usec"
  cpu: 2079.19995117
  cpu2: 2079.19995117
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 5018.39990234
  cpu2: 5018.39990234
  gpu: 1239.0
  npu: 699.233337402
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 5673.5
  cpu2: 5673.5
  gpu: 1306.0
  npu: 782.900024414
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 3424.0
  cpu2: 3424.0
  gpu: 623.0
  npu: 622.099975586
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 2986.10009766
  cpu2: 2986.10009766
  gpu: 849.0
  npu: 411.100006104
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 13173.2001953
  cpu2: 13173.2001953
  gpu: 2126.0
  npu: 1827.56665039
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 4231.5
  cpu2: 4231.5
  gpu: 808.0
  npu: 561.0
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 2127.80004883
  cpu2: 2127.80004883
  gpu: 638.0
  npu: 317.666656494
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 6018.39990234
  cpu2: 6018.39990234
  gpu: 1124.0
  npu: 858.333312988
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 4226.5
  cpu2: 4226.5
  gpu: 703.0
  npu: 713.233337402
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 2791.0
  cpu2: 2791.0
  gpu: 776.0
  npu: 424.333343506
}
layer {
  name: "s1"
  time_unit: "usec"
  cpu: 202.600006104
  cpu2: 202.600006104
  gpu: 64.0
  npu: 38.0999984741
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 5542.79980469
  cpu2: 5542.79980469
  gpu: 1114.0
  npu: 813.666687012
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 1641.59997559
  cpu2: 1641.59997559
  gpu: 502.0
  npu: 289.233337402
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 1151.90002441
  cpu2: 1151.90002441
  gpu: 526.0
  npu: 192.666671753
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 2411.89990234
  cpu2: 2411.89990234
  gpu: 704.0
  npu: 362.766662598
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 1995.09997559
  cpu2: 1995.09997559
  gpu: 463.0
  npu: 345.666656494
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 1426.40002441
  cpu2: 1426.40002441
  gpu: 592.0
  npu: 232.433334351
}
layer {
  name: "s2"
  time_unit: "usec"
  cpu: 125.699996948
  cpu2: 125.699996948
  gpu: 20.0
  npu: 27.0
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 2403.39990234
  cpu2: 2403.39990234
  gpu: 720.0
  npu: 367.766662598
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 1973.0
  cpu2: 1973.0
  gpu: 462.0
  npu: 344.0
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 1410.80004883
  cpu2: 1410.80004883
  gpu: 608.0
  npu: 224.899993896
}
layer {
  name: "s3"
  time_unit: "usec"
  cpu: 129.199996948
  cpu2: 129.199996948
  gpu: 20.0
  npu: 25.2333335876
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 2406.89990234
  cpu2: 2406.89990234
  gpu: 728.0
  npu: 372.766662598
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 1991.59997559
  cpu2: 1991.59997559
  gpu: 458.0
  npu: 342.766662598
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 1925.19995117
  cpu2: 1925.19995117
  gpu: 660.0
  npu: 289.100006104
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 4991.70019531
  cpu2: 4991.70019531
  gpu: 1120.0
  npu: 713.766662598
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 3608.5
  cpu2: 3608.5
  gpu: 634.0
  npu: 634.333312988
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 3123.39990234
  cpu2: 3123.39990234
  gpu: 973.0
  npu: 461.766662598
}
layer {
  name: "s4"
  time_unit: "usec"
  cpu: 207.199996948
  cpu2: 207.199996948
  gpu: 41.0
  npu: 32.2333335876
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 5003.79980469
  cpu2: 5003.79980469
  gpu: 1109.0
  npu: 727.900024414
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 3585.89990234
  cpu2: 3585.89990234
  gpu: 637.0
  npu: 636.900024414
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 3102.69995117
  cpu2: 3102.69995117
  gpu: 974.0
  npu: 448.433319092
}
layer {
  name: "s5"
  time_unit: "usec"
  cpu: 209.699996948
  cpu2: 209.699996948
  gpu: 41.0
  npu: 32.4333343506
}
layer {
  name: "c29"
  time_unit: "usec"
  cpu: 4968.10009766
  cpu2: 4968.10009766
  gpu: 1114.0
  npu: 715.433349609
}
layer {
  name: "c30"
  time_unit: "usec"
  cpu: 3577.89990234
  cpu2: 3577.89990234
  gpu: 618.0
  npu: 632.333312988
}
layer {
  name: "c31"
  time_unit: "usec"
  cpu: 3115.80004883
  cpu2: 3115.80004883
  gpu: 970.0
  npu: 447.899993896
}
layer {
  name: "s6"
  time_unit: "usec"
  cpu: 212.199996948
  cpu2: 212.199996948
  gpu: 41.0
  npu: 32.0999984741
}
layer {
  name: "c32"
  time_unit: "usec"
  cpu: 4869.10009766
  cpu2: 4869.10009766
  gpu: 1111.0
  npu: 711.766662598
}
layer {
  name: "c33"
  time_unit: "usec"
  cpu: 1402.30004883
  cpu2: 1402.30004883
  gpu: 506.0
  npu: 259.666656494
}
layer {
  name: "c34"
  time_unit: "usec"
  cpu: 919.099975586
  cpu2: 919.099975586
  gpu: 678.0
  npu: 166.766662598
}
layer {
  name: "c35"
  time_unit: "usec"
  cpu: 1976.0
  cpu2: 1976.0
  gpu: 788.0
  npu: 330.433319092
}
layer {
  name: "c36"
  time_unit: "usec"
  cpu: 1756.30004883
  cpu2: 1756.30004883
  gpu: 499.0
  npu: 291.433319092
}
layer {
  name: "c37"
  time_unit: "usec"
  cpu: 1320.30004883
  cpu2: 1320.30004883
  gpu: 868.0
  npu: 245.566665649
}
layer {
  name: "s7"
  time_unit: "usec"
  cpu: 88.5
  cpu2: 88.5
  gpu: 18.0
  npu: 19.7666664124
}
layer {
  name: "c38"
  time_unit: "usec"
  cpu: 1995.59997559
  cpu2: 1995.59997559
  gpu: 817.0
  npu: 332.100006104
}
layer {
  name: "c39"
  time_unit: "usec"
  cpu: 1754.19995117
  cpu2: 1754.19995117
  gpu: 512.0
  npu: 294.666656494
}
layer {
  name: "c40"
  time_unit: "usec"
  cpu: 1292.69995117
  cpu2: 1292.69995117
  gpu: 877.0
  npu: 238.100006104
}
layer {
  name: "s8"
  time_unit: "usec"
  cpu: 86.5
  cpu2: 86.5
  gpu: 17.0
  npu: 18.7666664124
}
layer {
  name: "c41"
  time_unit: "usec"
  cpu: 2003.09997559
  cpu2: 2003.09997559
  gpu: 806.0
  npu: 339.566680908
}
layer {
  name: "c42"
  time_unit: "usec"
  cpu: 646.099975586
  cpu2: 646.099975586
  gpu: 440.0
  npu: 182.566665649
}
layer {
  name: "c43"
  time_unit: "usec"
  cpu: 1172.0
  cpu2: 1172.0
  gpu: 818.0
  npu: 290.233337402
}
layer {
  name: "c44"
  time_unit: "usec"
  cpu: 2248.0
  cpu2: 2248.0
  gpu: 697.0
  npu: 492.666656494
}
layer {
  name: "c45"
  time_unit: "usec"
  cpu: 1144.40002441
  cpu2: 1144.40002441
  gpu: 428.0
  npu: 258.100006104
}
layer {
  name: "c46"
  time_unit: "usec"
  cpu: 1816.09997559
  cpu2: 1816.09997559
  gpu: 1099.0
  npu: 457.0
}
layer {
  name: "s9"
  time_unit: "usec"
  cpu: 71.9000015259
  cpu2: 71.9000015259
  gpu: 16.0
  npu: 20.6666660309
}
layer {
  name: "c47"
  time_unit: "usec"
  cpu: 2245.0
  cpu2: 2245.0
  gpu: 712.0
  npu: 487.233337402
}
layer {
  name: "c48"
  time_unit: "usec"
  cpu: 1132.80004883
  cpu2: 1132.80004883
  gpu: 430.0
  npu: 263.233337402
}
layer {
  name: "c49"
  time_unit: "usec"
  cpu: 1816.59997559
  cpu2: 1816.59997559
  gpu: 1114.0
  npu: 458.0
}
layer {
  name: "s10"
  time_unit: "usec"
  cpu: 72.9000015259
  cpu2: 72.9000015259
  gpu: 16.0
  npu: 19.8999996185
}
layer {
  name: "c50"
  time_unit: "usec"
  cpu: 2357.60009766
  cpu2: 2357.60009766
  gpu: 729.0
  npu: 492.233337402
}
layer {
  name: "c51"
  time_unit: "usec"
  cpu: 1094.09997559
  cpu2: 1094.09997559
  gpu: 455.0
  npu: 259.233337402
}
layer {
  name: "c52"
  time_unit: "usec"
  cpu: 3228.39990234
  cpu2: 3228.39990234
  gpu: 1172.0
  npu: 816.233337402
}
layer {
  name: "c53"
  time_unit: "usec"
  cpu: 4376.79980469
  cpu2: 4376.79980469
  gpu: 1101.0
  npu: 1020.90002441
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 179.5
  cpu2: 179.5
  gpu: 33.0
  npu: 50.5666656494
}
layer {
  name: "c54"
  time_unit: "usec"
  cpu: 649.099975586
  cpu2: 649.099975586
  gpu: 946.0
  npu: 168.333328247
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 12.1000003815
  cpu2: 12.1000003815
  gpu: 999999.0
  npu: 999999.0
}
