layer {
  name: "front"
  time_unit: "usec"
  cpu: 2079.19995117
  cpu2: 2079.19995117
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 3868.30004883
  cpu2: 7693.20019531
  gpu: 1239.0
  npu: 209.770004272
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 4397.29980469
  cpu2: 8698.09960938
  gpu: 1306.0
  npu: 234.869995117
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 2836.30004883
  cpu2: 4718.39990234
  gpu: 623.0
  npu: 186.630004883
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 2306.0
  cpu2: 4506.89990234
  gpu: 849.0
  npu: 123.330001831
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 10100.0
  cpu2: 20041.6992188
  gpu: 2126.0
  npu: 548.270019531
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 3301.69995117
  cpu2: 6739.60009766
  gpu: 808.0
  npu: 168.300003052
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 1599.0
  cpu2: 3086.89990234
  gpu: 638.0
  npu: 95.3000030518
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 4505.70019531
  cpu2: 9151.29980469
  gpu: 1124.0
  npu: 257.5
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 3193.30004883
  cpu2: 5811.5
  gpu: 703.0
  npu: 213.970001221
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 2054.30004883
  cpu2: 4150.70019531
  gpu: 776.0
  npu: 127.300003052
}
layer {
  name: "s1"
  time_unit: "usec"
  cpu: 149.300003052
  cpu2: 199.800003052
  gpu: 64.0
  npu: 11.4300003052
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 4143.70019531
  cpu2: 8372.09960938
  gpu: 1114.0
  npu: 244.100006104
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 1220.69995117
  cpu2: 1952.90002441
  gpu: 502.0
  npu: 86.7699966431
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 855.0
  cpu2: 1686.69995117
  gpu: 526.0
  npu: 57.7999992371
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 1786.0
  cpu2: 3456.30004883
  gpu: 704.0
  npu: 108.830001831
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 1464.30004883
  cpu2: 2251.10009766
  gpu: 463.0
  npu: 103.699996948
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 1045.0
  cpu2: 1964.19995117
  gpu: 592.0
  npu: 69.7300033569
}
layer {
  name: "s2"
  time_unit: "usec"
  cpu: 88.6999969482
  cpu2: 119.699996948
  gpu: 20.0
  npu: 8.10000038147
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 1778.69995117
  cpu2: 3451.5
  gpu: 720.0
  npu: 110.330001831
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 1453.69995117
  cpu2: 2228.0
  gpu: 462.0
  npu: 103.199996948
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 1038.69995117
  cpu2: 1957.59997559
  gpu: 608.0
  npu: 67.4700012207
}
layer {
  name: "s3"
  time_unit: "usec"
  cpu: 93.0
  cpu2: 139.899993896
  gpu: 20.0
  npu: 7.57000017166
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 1772.69995117
  cpu2: 3395.89990234
  gpu: 728.0
  npu: 111.830001831
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 1439.30004883
  cpu2: 2229.39990234
  gpu: 458.0
  npu: 102.830001831
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 1417.30004883
  cpu2: 2776.89990234
  gpu: 660.0
  npu: 86.7300033569
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 3709.69995117
  cpu2: 7403.0
  gpu: 1120.0
  npu: 214.130004883
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 2606.30004883
  cpu2: 4426.29980469
  gpu: 634.0
  npu: 190.300003052
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 2335.30004883
  cpu2: 4652.5
  gpu: 973.0
  npu: 138.529998779
}
layer {
  name: "s4"
  time_unit: "usec"
  cpu: 151.0
  cpu2: 275.600006104
  gpu: 41.0
  npu: 9.67000007629
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 3717.69995117
  cpu2: 7465.10009766
  gpu: 1109.0
  npu: 218.369995117
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 2603.69995117
  cpu2: 4447.5
  gpu: 637.0
  npu: 191.070007324
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 2294.0
  cpu2: 4719.39990234
  gpu: 974.0
  npu: 134.529998779
}
layer {
  name: "s5"
  time_unit: "usec"
  cpu: 152.300003052
  cpu2: 275.600006104
  gpu: 41.0
  npu: 9.72999954224
}
layer {
  name: "c29"
  time_unit: "usec"
  cpu: 3667.69995117
  cpu2: 7427.89990234
  gpu: 1114.0
  npu: 214.630004883
}
layer {
  name: "c30"
  time_unit: "usec"
  cpu: 2593.30004883
  cpu2: 4412.20019531
  gpu: 618.0
  npu: 189.699996948
}
layer {
  name: "c31"
  time_unit: "usec"
  cpu: 2304.30004883
  cpu2: 4558.70019531
  gpu: 970.0
  npu: 134.369995117
}
layer {
  name: "s6"
  time_unit: "usec"
  cpu: 152.300003052
  cpu2: 277.0
  gpu: 41.0
  npu: 9.63000011444
}
layer {
  name: "c32"
  time_unit: "usec"
  cpu: 3671.30004883
  cpu2: 7229.10009766
  gpu: 1111.0
  npu: 213.529998779
}
layer {
  name: "c33"
  time_unit: "usec"
  cpu: 1000.29998779
  cpu2: 1589.09997559
  gpu: 506.0
  npu: 77.9000015259
}
layer {
  name: "c34"
  time_unit: "usec"
  cpu: 636.299987793
  cpu2: 1184.0
  gpu: 678.0
  npu: 50.0299987793
}
layer {
  name: "c35"
  time_unit: "usec"
  cpu: 1405.0
  cpu2: 2784.89990234
  gpu: 788.0
  npu: 99.1299972534
}
layer {
  name: "c36"
  time_unit: "usec"
  cpu: 1219.69995117
  cpu2: 1997.59997559
  gpu: 499.0
  npu: 87.4300003052
}
layer {
  name: "c37"
  time_unit: "usec"
  cpu: 872.299987793
  cpu2: 1739.90002441
  gpu: 868.0
  npu: 73.6699981689
}
layer {
  name: "s7"
  time_unit: "usec"
  cpu: 60.0
  cpu2: 58.4000015259
  gpu: 18.0
  npu: 5.92999982834
}
layer {
  name: "c38"
  time_unit: "usec"
  cpu: 1424.69995117
  cpu2: 2790.10009766
  gpu: 817.0
  npu: 99.6299972534
}
layer {
  name: "c39"
  time_unit: "usec"
  cpu: 1224.0
  cpu2: 1986.80004883
  gpu: 512.0
  npu: 88.4000015259
}
layer {
  name: "c40"
  time_unit: "usec"
  cpu: 872.299987793
  cpu2: 1749.80004883
  gpu: 877.0
  npu: 71.4300003052
}
layer {
  name: "s8"
  time_unit: "usec"
  cpu: 58.7000007629
  cpu2: 55.0999984741
  gpu: 17.0
  npu: 5.63000011444
}
layer {
  name: "c41"
  time_unit: "usec"
  cpu: 1466.0
  cpu2: 2699.60009766
  gpu: 806.0
  npu: 101.870002747
}
layer {
  name: "c42"
  time_unit: "usec"
  cpu: 439.0
  cpu2: 490.5
  gpu: 440.0
  npu: 54.7700004578
}
layer {
  name: "c43"
  time_unit: "usec"
  cpu: 832.299987793
  cpu2: 1161.80004883
  gpu: 818.0
  npu: 87.0699996948
}
layer {
  name: "c44"
  time_unit: "usec"
  cpu: 1632.0
  cpu2: 2217.60009766
  gpu: 697.0
  npu: 147.800003052
}
layer {
  name: "c45"
  time_unit: "usec"
  cpu: 754.0
  cpu2: 1046.40002441
  gpu: 428.0
  npu: 77.4300003052
}
layer {
  name: "c46"
  time_unit: "usec"
  cpu: 1292.30004883
  cpu2: 1793.09997559
  gpu: 1099.0
  npu: 137.100006104
}
layer {
  name: "s9"
  time_unit: "usec"
  cpu: 51.2999992371
  cpu2: 53.2000007629
  gpu: 16.0
  npu: 6.19999980927
}
layer {
  name: "c47"
  time_unit: "usec"
  cpu: 1754.69995117
  cpu2: 2216.69995117
  gpu: 712.0
  npu: 146.169998169
}
layer {
  name: "c48"
  time_unit: "usec"
  cpu: 750.0
  cpu2: 1018.09997559
  gpu: 430.0
  npu: 78.9700012207
}
layer {
  name: "c49"
  time_unit: "usec"
  cpu: 1287.0
  cpu2: 1775.19995117
  gpu: 1114.0
  npu: 137.399993896
}
layer {
  name: "s10"
  time_unit: "usec"
  cpu: 51.7000007629
  cpu2: 52.2999992371
  gpu: 16.0
  npu: 5.96999979019
}
layer {
  name: "c50"
  time_unit: "usec"
  cpu: 1884.69995117
  cpu2: 2214.80004883
  gpu: 729.0
  npu: 147.669998169
}
layer {
  name: "c51"
  time_unit: "usec"
  cpu: 748.700012207
  cpu2: 1023.79998779
  gpu: 455.0
  npu: 77.7699966431
}
layer {
  name: "c52"
  time_unit: "usec"
  cpu: 2316.30004883
  cpu2: 3165.60009766
  gpu: 1172.0
  npu: 244.869995117
}
layer {
  name: "c53"
  time_unit: "usec"
  cpu: 3215.69995117
  cpu2: 4641.20019531
  gpu: 1101.0
  npu: 306.269989014
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 128.300003052
  cpu2: 153.100006104
  gpu: 33.0
  npu: 15.1700000763
}
layer {
  name: "c54"
  time_unit: "usec"
  cpu: 489.700012207
  cpu2: 687.900024414
  gpu: 946.0
  npu: 50.5
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 12.1000003815
  cpu2: 12.1000003815
  gpu: 999999.0
  npu: 999999.0
}
