layer {
  name: "front"
  time_unit: "usec"
  cpu: 3114.30004883
  cpu2: 3114.30004883
  cpu3: 3114.30004883
  gpu: 999999.0
  npu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 11474.2998047
  cpu2: 19756.0
  cpu3: 19756.0
  gpu: 1743.0
  npu: 263.420013428
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 2103.69995117
  cpu2: 3730.0
  cpu3: 3730.0
  gpu: 433.0
  npu: 50.8666648865
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 1658.0
  cpu2: 2924.0
  cpu3: 2924.0
  gpu: 579.0
  npu: 51.3333320618
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 2322.69995117
  cpu2: 4302.70019531
  cpu3: 4302.70019531
  gpu: 594.0
  npu: 80.5533370972
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 5749.70019531
  cpu2: 11117.0
  cpu3: 11117.0
  gpu: 914.0
  npu: 129.779998779
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 3274.69995117
  cpu2: 6218.29980469
  cpu3: 6218.29980469
  gpu: 775.0
  npu: 78.2666702271
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 2247.30004883
  cpu2: 4321.0
  cpu3: 4321.0
  gpu: 575.0
  npu: 80.1800003052
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 5736.0
  cpu2: 11513.0
  cpu3: 11513.0
  gpu: 935.0
  npu: 130.133331299
}
layer {
  name: "p2"
  time_unit: "usec"
  cpu: 1026.0
  cpu2: 1803.30004883
  cpu3: 1803.30004883
  gpu: 307.0
  npu: 35.8199996948
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 984.299987793
  cpu2: 1753.30004883
  cpu3: 1753.30004883
  gpu: 425.0
  npu: 32.6666679382
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 1327.69995117
  cpu2: 2499.0
  cpu3: 2499.0
  gpu: 449.0
  npu: 48.9333343506
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 3761.30004883
  cpu2: 6422.70019531
  cpu3: 6422.70019531
  gpu: 708.0
  npu: 178.913330078
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 1829.0
  cpu2: 3253.30004883
  cpu3: 3253.30004883
  gpu: 539.0
  npu: 52.0466651917
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 1376.30004883
  cpu2: 2509.30004883
  cpu3: 2509.30004883
  gpu: 461.0
  npu: 49.0200004578
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 3909.30004883
  cpu2: 6531.70019531
  cpu3: 6531.70019531
  gpu: 744.0
  npu: 178.553329468
}
layer {
  name: "p3"
  time_unit: "usec"
  cpu: 588.299987793
  cpu2: 996.299987793
  cpu3: 996.299987793
  gpu: 242.0
  npu: 28.1333332062
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 516.299987793
  cpu2: 873.0
  cpu3: 873.0
  gpu: 433.0
  npu: 21.6200008392
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 533.700012207
  cpu2: 969.0
  cpu3: 969.0
  gpu: 345.0
  npu: 24.2000007629
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 2183.69995117
  cpu2: 3978.30004883
  cpu3: 3978.30004883
  gpu: 562.0
  npu: 62.0200004578
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 632.0
  cpu2: 1096.0
  cpu3: 1096.0
  gpu: 514.0
  npu: 25.8666667938
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 538.299987793
  cpu2: 962.299987793
  cpu3: 962.299987793
  gpu: 342.0
  npu: 24.9799995422
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 2158.30004883
  cpu2: 3952.0
  cpu3: 3952.0
  gpu: 551.0
  npu: 62.4199981689
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 802.299987793
  cpu2: 1377.69995117
  cpu3: 1377.69995117
  gpu: 527.0
  npu: 31.5333328247
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 800.700012207
  cpu2: 1379.0
  cpu3: 1379.0
  gpu: 373.0
  npu: 31.953332901
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 3652.0
  cpu2: 6473.29980469
  cpu3: 6473.29980469
  gpu: 709.0
  npu: 86.1133346558
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 1055.30004883
  cpu2: 1795.0
  cpu3: 1795.0
  gpu: 850.0
  npu: 40.8666648865
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 816.700012207
  cpu2: 1417.30004883
  cpu3: 1417.30004883
  gpu: 380.0
  npu: 32.1333351135
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 3679.69995117
  cpu2: 6413.0
  cpu3: 6413.0
  gpu: 704.0
  npu: 85.8866653442
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 9253.0
  cpu2: 17350.6992188
  cpu3: 17350.6992188
  gpu: 2155.0
  npu: 333.733337402
}
layer {
  name: "p4"
  time_unit: "usec"
  cpu: 922.700012207
  cpu2: 920.299987793
  cpu3: 920.299987793
  gpu: 49.0
  npu: 41.0466651917
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 19.0
  cpu2: 19.0
  cpu3: 19.0
  gpu: 999999.0
  npu: 999999.0
}
